import React from 'react';
import { Line } from '@ant-design/charts';

const defaultData = [
  { 城市: '和田', 销售额: 6236.188 },
  { 城市: '和龙', 销售额: 2508.8 },
  { 城市: '咸宁', 销售额: 3641.176 },
  { 城市: '咸水沽', 销售额: 9269.54 },
  { 城市: '咸阳', 销售额: 48721.68 },
  { 城市: '哈尔滨', 销售额: 205688.2309999999 },
  { 城市: '唐家庄', 销售额: 10473.155 },
  { 城市: '唐寨', 销售额: 4985.26 },
  { 城市: '唐山', 销售额: 94901.94 },
  { 城市: '唐河', 销售额: 1764.896 },
  { 城市: '商丘', 销售额: 36668.275 },
  { 城市: '嘉兴', 销售额: 24912.412 },
  { 城市: '嘉善', 销售额: 1711.08 },
  { 城市: '嘉峪关', 销售额: 20206.928 },
  { 城市: '四平', 销售额: 28710.22 },
  { 城市: '图们', 销售额: 7932.68 },
  { 城市: '坪山', 销售额: 2715.23 },
  { 城市: '埠河', 销售额: 11368.224 },
  { 城市: '塔河', 销售额: 724.5 },
  { 城市: '塘坪', 销售额: 7726.936 },
  { 城市: '塘沽', 销售额: 45260.46 },
  { 城市: '夏镇', 销售额: 4270.56 },
  { 城市: '大冶', 销售额: 319.788 },
  { 城市: '大同', 销售额: 133256.41 },
  { 城市: '大庆', 销售额: 58345.77 },
  { 城市: '大理', 销售额: 3253.32 },
  { 城市: '大连', 销售额: 94385.704 },
  { 城市: '大连湾', 销售额: 3259.592 },
  { 城市: '天津', 销售额: 471183.5099999999 },
  { 城市: '天长', 销售额: 22612.59 },
  { 城市: '太原', 销售额: 171042.6200000001 },
  { 城市: '姜堰', 销售额: 8361.92 },
  { 城市: '威宁', 销售额: 6516.44 },
  { 城市: '威海', 销售额: 16084.32 },
  { 城市: '娄底', 销售额: 2537.78 },
  { 城市: '嫩江', 销售额: 253.26 },
  { 城市: '孝感', 销售额: 18652.256 },
  { 城市: '宁波', 销售额: 31039.96 },
  { 城市: '宁海', 销售额: 46008.9 },
  { 城市: '宁阳', 销售额: 2063.18 },
  { 城市: '安丘', 销售额: 2400.86 },
  { 城市: '安埠', 销售额: 4144 },
  { 城市: '安庆', 销售额: 10239.292 },
  { 城市: '安康', 销售额: 95.76 },
];
const DemoLine = (props) => {
  const config = {
    title: {
      visible: false,
      text: props.title || '为折线添加缩略轴交互',
    },
    description: {
      visible: false,
      text:
        props.remark ||
        '缩略轴 (slider) 交互适用于折线数据较多\uFF0C用户希望关注数据集中某个特殊区间的场景\u3002',
    },
    forceFit: true,
    padding: 'auto',
    data: defaultData,
    xField: props.chartsField || '城市',
    xAxis: {
      visible: true,
      label: { autoHide: true },
    },
    yField: props.value || '销售额',
    interactions: [
      {
        type: 'slider',
        cfg: {
          start: 0,
          end: 1,
        },
      },
    ],
  };
  const { data = [] } = props;
  if (data.length > 0 && props.chartsField && props.value) {
    config.data = data;
  }
  return <Line {...config} />;
};

export default DemoLine;
