import React from 'react';
import { Column } from '@ant-design/charts';

const defaultData = [
  { 城市: '化州', 销售额: 9078.944 },
  { 城市: '北京', 销售额: 376814.9000000002 },
  { 城市: '北海', 销售额: 525.672 },
  { 城市: '北碚', 销售额: 5338.06 },
  { 城市: '北票', 销售额: 7948.164 },
  { 城市: '十字路', 销售额: 6417.88 },
  { 城市: '南京', 销售额: 8300.068 },
  { 城市: '南充', 销售额: 23797.284 },
  { 城市: '南台', 销售额: 5839.848 },
  { 城市: '南宁', 销售额: 118154.078 },
  { 城市: '南宫', 销售额: 14725.48 },
  { 城市: '南岔', 销售额: 24002.16 },
  { 城市: '南平', 销售额: 11266.22 },
  { 城市: '南昌', 销售额: 46190.62 },
  { 城市: '南洲', 销售额: 1111.32 },
  { 城市: '南渡', 销售额: 23807.56 },
  { 城市: '南票', 销售额: 3059.868 },
  { 城市: '南通', 销售额: 26558.504 },
  { 城市: '南阳', 销售额: 62104.546 },
  { 城市: '南隆', 销售额: 546 },
  { 城市: '南麻', 销售额: 5940.48 },
  { 城市: '即墨', 销售额: 14251.58 },
  { 城市: '原平', 销售额: 97.58 },
  { 城市: '厦门', 销售额: 144801.944 },
  { 城市: '友好', 销售额: 9571.8 },
  { 城市: '双城', 销售额: 784.84 },
  { 城市: '双阳', 销售额: 4786.6 },
  { 城市: '双鸭山', 销售额: 13395.76 },
  { 城市: '台城', 销售额: 3541.44 },
  { 城市: '叶柏寿', 销售额: 1199.716 },
  { 城市: '合川', 销售额: 34747.076 },
  { 城市: '合德', 销售额: 14716.38 },
  { 城市: '合肥', 销售额: 82420.548 },
  { 城市: '吉林市', 销售额: 46497.829 },
  { 城市: '吉舒', 销售额: 88.34 },
  { 城市: '吉首', 销售额: 9007.642 },
  { 城市: '启东', 销售额: 22022.672 },
  { 城市: '吴川', 销售额: 8995.644 },
  { 城市: '周口', 销售额: 44941.442 },
  { 城市: '周村', 销售额: 10413.06 },
  { 城市: '呼兰', 销售额: 18749.64 },
  { 城市: '呼和浩特', 销售额: 27756.26 },
  { 城市: '和田', 销售额: 6236.188 },
  { 城市: '和龙', 销售额: 2508.8 },
  { 城市: '咸宁', 销售额: 3641.176 },
  { 城市: '咸水沽', 销售额: 9269.54 },
  { 城市: '咸阳', 销售额: 48721.68 },
  { 城市: '哈尔滨', 销售额: 205688.2309999999 },
  { 城市: '唐家庄', 销售额: 10473.155 },
  { 城市: '唐寨', 销售额: 4985.26 },
  { 城市: '唐山', 销售额: 94901.94 },
  { 城市: '唐河', 销售额: 1764.896 },
  { 城市: '商丘', 销售额: 36668.275 },
  { 城市: '嘉兴', 销售额: 24912.412 },
  { 城市: '嘉善', 销售额: 1711.08 },
  { 城市: '嘉峪关', 销售额: 20206.928 },
  { 城市: '四平', 销售额: 28710.22 },
];
const ScalingColumn = (props) => {
  const config = {
    title: {
      visible: false,
      text: '基础柱状图-滚动条',
    },
    description: {
      visible: false,
      text: '当数据过多时\uFF0C推荐使用滚动条一次只浏览一部分数据\u3002',
    },
    forceFit: true,
    data: defaultData,
    padding: 'auto',
    xField: '城市',
    xAxis: {
      visible: true,
      label: { autoHide: true },
    },
    yAxis: {
      visible: true,
    },
    yField: '销售额',
    interactions: [{ type: 'scrollbar' }],
  };
  const { data = [] } = props;
  if (data.length > 0 && props.chartsField && props.value) {
    config.data = data;
    config.xField = props.chartsField;
    config.yField = props.value;
  }
  return <Column {...config} />;
};

export default ScalingColumn;
